Revit 2026 API

# ProjectInfoStatus Property

---

Get or Set the Project Status of the Project Information.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string Status { get; set; }
```
```vb
Public Property Status As String
	Get
	Set
```
```cpp
public:
property String^ Status {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member Status : string with get, set
```

#### Property Value

String

This property is used to get or set the Project Status of the Project Information.

#### Reference

ProjectInfo Class

Autodesk.Revit.DB Namespace